Revit 2024 API
Generic.ColorByObject Property
 The property labeled "Color By Object" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string ColorByObject { get; }
Visual Basic
Public Shared ReadOnly Property ColorByObject As String
	Get
Visual C++
public:
static property String^ ColorByObject {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Generic Class
Autodesk.Revit.DB.Visual Namespace